/*<<<<<<< HEAD
INSERT INTO movie (movie_id, title, sub_title, director, actor, country, release_date, description, img_path, play_time)
VALUES
(7, '아바타 : 불과 재', 'Avatar: Fire and Ash', '제임스 카메론', '샘 워싱턴, 조 샐다나', '미국', '2025-12-17', '판도라를 위협하는 재의 부족, 더 이상 인간만이 적이 아니다! 모두의 운명을 뒤흔들 거대한 전투가 시작된다! 인간들과의 전쟁으로 첫째 아들 ‘네테이얌’을 잃은 후, ‘제이크’와 ‘네이티리’는 깊은 슬픔에 빠진다. 상실에 빠진 이들 앞에 ''바랑''이 이끄는 재의 부족이 등장하면서, 판도라는 더욱 큰 위험에 빠지게 되고, ‘설리’ 가족은 선택의 기로에 서게 되는데…', '/static/img/movie/아바타.jpg', 197),
(9, '올빼미', 'The Night Owl', '안태진', '류준열, 유해진', '한국', '2022-11-23', '맹인이지만 뛰어난 침술 실력을 지닌 ‘경수’는 어의 ‘이형익’에게 그 재주를 인정받아 궁으로 들어간다. 그 무렵, 청에 인질로 끌려갔던 ‘소현세자’가 8년 만에 귀국하고, ‘인조’는 아들을 향한 반가움도 잠시 정체 모를 불안감에 휩싸인다. 그러던 어느 밤, 어둠 속에서는 희미하게 볼 수 있는 ‘경수’가 ‘소현세자’의 죽음을 목격하게 되고 진실을 알리려는 찰나 더 큰 비밀과 음모가 드러나며 목숨마저 위태로운 상황에 빠진다. 아들의 죽음 후 ‘인조’의 불안감은 광기로 변하여 폭주하기 시작하고 세자의 죽음을 목격한 ‘경수’로 인해 관련된 인물들의 민낯이 서서히 드러나게 되는데...', '/static/img/movie/올빼미.jpg', 118),
(10, '윗집사람들', 'The People Upstairs', '하정우', '하정우, 공효진', '한국', '2025-12-03', '"세상의 부부들은 정말 밤마다 사랑을 나눌까? 너희도 솔직해지고 싶지 않아?" 불같던 결혼 생활은 사라지고 무미건조한 일상만 남은 정아(공효진)와 현수(김동욱). 요즘 두 사람을 가장 괴롭히는 건, 매일 밤 지나치게 활기찬 소리를 내는 윗집 부부 김 선생(하정우)과 수경(이하늬)이다. 정아는 이사 공사 소음을 참아준 윗집 부부를 위해 예의상 저녁 식사 자리를 마련하고 그날 저녁, 식탁에 마주 앉은 윗집 부부는 정아와 현수에게 전혀 예상하지 못한 제안을 하게 되는데…', '/static/img/movie/윗집사람들.jpg', 107),
(11, '주술회전 시부야사변X사멸회유', 'JUJUTSU KAISEN: Shibuya Incident', '고쇼조노 쇼타', '에노키 준야, 나카무라 유이치', '일본', '2025-12-03', '2018년 10월 31일 시부야 역 주변에 갑자기 ‘장막’이 내려지고, 다수의 일반인이 갇히게 된다. 그곳에 홀로 뛰어든 현대 최강의 주술사, 고죠 사토루. 그러나 그곳에는 고죠의 봉인을 꾀하는 주저사·주령들이 기다리고 있었다. 시부야에 집결하는 이타도리 유지를 비롯한 수많은 주술사들. 전례 없는 대규모 주술전 「시부야사변」이 시작된다-. 그리고 싸움은, 최악의 주술사 카모 노리토시가 꾸민 데스 게임 「사멸회유」로 이어진다. 「시부야사변」을 거쳐, 마굴로 변한 전국 10개의 결계(콜로니). 대혼란의 한가운데, 이타도리의 사형 집행인으로 특급 주술사 옷코츠 유타가 나타난다. 절망 속에서도 싸움을 계속하는 이타도리. 무정하게도 칼날을 겨누는 옷코츠. 가속해가는 저주의 혼돈. 같은 스승을 둔 이타도리와 옷코츠, 두 사람의 사투가 시작된다.', '/static/img/movie/주술회전.jpg', 138),
(12, '주토피아 2', 'Zootopia 2', '자레드 부시, 바이론 하워드', '지니퍼 굿윈, 제이슨 베이트먼', '미국', '2025-11-26', '더 화려해진 세계, 더 넓어진 주토피아! 가~~장 사랑스러운 콤비 ''주디''와 ''닉''이 돌아온다! 미스터리한 뱀 ‘게리’가 나타난 순간, 주토피아가 다시 흔들리기 시작했다! 혼란에 빠진 도시를 구하기 위해 환상의 콤비 ‘주디’ & ‘닉’이 잠입 수사에 나서고 상상 그 이상의 진실과 위협을 마주하게 되는데...! 초특급 추적 어드벤처가 펼쳐진다!', '/static/img/movie/주토피아.jpg', 108),
(13, '파묘', 'Exhuma', '장재현', '최민식, 김고은', '한국', '2024-02-22', '미국 LA, 거액의 의뢰를 받은 무당 ‘화림’(김고은)과 ‘봉길’(이도현)은 기이한 병이 대물림되는 집안의 장손을 만난다. 조상의 묫자리가 화근임을 알아챈 ‘화림’은 이장을 권하고, 돈 냄새를 맡은 최고의 풍수사 ‘상덕’(최민식)과 장의사 ‘영근’(유해진)이 합류한다. “전부 잘 알 거야… 묘 하나 잘못 건들면 어떻게 되는지” 절대 사람이 묻힐 수 없는 악지에 자리한 기이한 묘. ‘상덕’은 불길한 기운을 느끼고 제안을 거절하지만, ‘화림’의 설득으로 결국 파묘가 시작되고… 나와서는 안될 것이 나왔다.', '/static/img/movie/파묘.jpg', 134),
(14, '프레디의 피자가게2', 'Five Nights at Freddys 2', '엠마 타미', '조쉬 하처슨, 엘리자베스 라일', '미국', '2025-12-03', '다시 밤이 되었습니다 마스코트들은 이제 밖으로 나가주세요 소문과 괴담에 휘말려 폐업한 ‘프레디의 피자가게’ 본점이 수십년 만에 다시 열리고, 그곳에 오랫동안 잠들어 있던 신형 프레디와 친구들이 눈을 뜨게 된다. 안면 인식 시스템을 가진 한층 더 기괴하고 오싹해진 신형 애니메트로닉스들은 이제 피자가게 밖으로 나와 세상을 공포에 몰아넣기 시작하는데…', '/static/img/movie/피자가게2.jpg', 104);
=======
DROP TABLE IF EXISTS review;
DROP TABLE IF EXISTS movie_genre;
DROP TABLE IF EXISTS users;
DROP TABLE IF EXISTS movie;
CREATE TABLE movie (
    movie_id INT AUTO_INCREMENT,
    title VARCHAR(300) NOT NULL,
    sub_title VARCHAR(300),
    director VARCHAR(150),
    actor VARCHAR(500),
    country VARCHAR(100),
    release_date DATE,
    description TEXT,
    img_path VARCHAR(1000),
    play_time INT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    detail_img_path TEXT,
    CONSTRAINT pk_movie PRIMARY KEY (movie_id)
);
>>>>>>> refs/heads/main

<<<<<<< HEAD
SELECT * FROM movie
=======







CREATE TABLE review (
    review_id INT AUTO_INCREMENT,
    content TEXT NOT NULL,
    rating DECIMAL(2,1),
    created_at DATETIME DEFAULT CURRENT_TIMESTAMP,
    updated_at DATETIME,
    movie_id INT NOT NULL,
    user_id INT NOT NULL,
    CONSTRAINT pk_review PRIMARY KEY (review_id),
    CONSTRAINT fk_review_movie FOREIGN KEY (movie_id)
        REFERENCES movie (movie_id)
        ON DELETE CASCADE,
    CONSTRAINT fk_review_user FOREIGN KEY (user_id)
        REFERENCES users (no)
        ON DELETE CASCADE
);

CREATE TABLE movie_genre (
    movie_id INT NOT NULL,
    genre VARCHAR(100) NOT NULL,
    CONSTRAINT pk_movie_genre PRIMARY KEY (movie_id, genre),
    CONSTRAINT fk_genre_movie FOREIGN KEY (movie_id)
        REFERENCES movie (movie_id)
        ON DELETE CASCADE
);

ALTER TABLE review
ADD CONSTRAINT uk_review_user_movie UNIQUE (user_id, movie_id);

SELECT * FROM MOVIE;
SELECT * FROM USERS;
>>>>>>> refs/heads/main*/
--UPDATE movie
--SET release_date = '2023-11-22'
--WHERE movie_id = 5;
--INSERT IGNORE INTO movie_genre (movie_id, genre)
--VALUES
--(1, 'SF'),
--(2, '미스터리'),
--(3, '액션'),
--(4, '액션'),
--(5, '드라마'),
--(6, '판타지'),
--(7, 'SF'),
--(8, '범죄'),
--(9, '스릴러'),
--(10, '드라마'),
--(11, '애니메이션'),
--(12, '애니메이션'),
--(13, '미스터리'),
--(14, '공포'),
--(15, '액션');
/*INSERT IGNORE INTO movie_genre (movie_id, genre)
VALUES(1, 'SF'),(2, '미스터리'),(3, '액션'),
(4, '액션'),(5, '드라마'),(6, '판타지'),(7, 'SF'),(8, '범죄'),(9, '스릴러'),(10, '드라마'),(11, '애니메이션'),(12, '애니메이션'),(13, '미스터리'),(14, '공포'),(15, '액션'),
(16, '로멘스');


INSERT INTO movie (movie_id, title, sub_title, director, actor, country, release_date, description, img_path, play_time)VALUES(16, '만약에 우리', 'Once We Were Us', '김도영', '구교환, 문가영', '대한민국', '2025-12-31', '"가장 초라했던 그때, 가장 눈부시던 우리" 고향 가는 고속버스에 올라탄 은호(구교환)와 휴학 후 어디론가 떠날 결심을 한 정원(문가영), 나란히 앉게 된 두 사람은 뜻밖의 인연을 맺는다. 서로의 꿈을 응원하며 의지하던 두 사람은 어느새 일상 깊숙이 스며들어 연인으로 발전한다. 웃고, 싸우고, 화해하며 세상을 다 가진 듯 뜨겁게 사랑하지만, 현실의 벽 앞에 두 사람은 결국 다른 길을 선택하게 된다. 그렇게 10년이 지난 후, 다시 마주한 순간 은호는 정원에게 오랫동안 묻어두었던 한마디를 꺼낸다. “만약에 우리...”', '115 ''/static/img/movie/만약에우리.jpg', 115);
UPDATE movieSET detail_img_path = '/static/img/movie/만약에우리.jpg'WHERE movie_id = 16;*/

--CREATE TABLE users (
--	no INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
--	id VARCHAR(64) NOT NULL UNIQUE,
--	username VARCHAR(100) NOT NULL,
--	password VARCHAR(100) NOT NULL,
--	name VARCHAR(100) NOT NULL,
--	email VARCHAR(100) NULL,
--	birth VARCHAR(100) NULL,
--	tel   VARCHAR(100) NULL,
--	created_at TIMESTAMP NOT NULL DEFAULT now(),
--	updated_at TIMESTAMP NOT NULL DEFAULT now()
--);
--(7, '아바타 : 불과 재', 'Avatar: Fire and Ash', '제임스 카메론', '샘 워싱턴, 조 샐다나', '미국', '2025-12-17', '판도라를 위협하는 재의 부족, 더 이상 인간만이 적이 아니다! 모두의 운명을 뒤흔들 거대한 전투가 시작된다! 인간들과의 전쟁으로 첫째 아들 ‘네테이얌’을 잃은 후, ‘제이크’와 ‘네이티리’는 깊은 슬픔에 빠진다. 상실에 빠진 이들 앞에 ''바랑''이 이끄는 재의 부족이 등장하면서, 판도라는 더욱 큰 위험에 빠지게 되고, ‘설리’ 가족은 선택의 기로에 서게 되는데…', '/static/img/movie/아바타.jpg', 197),
--INSERT INTO movie (movie_id, title, sub_title, director, actor, country, release_date, description, img_path, play_time, detail_img_path)
--VALUES
--(3, '더 러닝맨', 'The Running Man', '에드가 라이트', '글렌 파월, 리 페이스', '영국', '2025-12-10', '독점 기업 ‘네트워크’의 지배 하에 모든 것이 통제되는 미래 사회. 직장에서 해고된 ‘벤 리처즈’(글렌 파월)는 아픈 딸의 약값을 마련하기 위해 최고의 시청률을 자랑하는 리얼리티 쇼 ‘더 러닝 맨’에 참가한다. 30일간 끝까지 살아남으면 10억 달러의 상금이 주어지는 서바이벌 게임 ‘더 러닝 맨’. 하지만 잔혹한 전문 헌터들이 참가자를 쫓고 시청자들은 실시간 제보를 이어가며, 이 모든 과정은 전 세계에 생중계된다. 지금껏 그 누구도 성공하지 못한 게임에 목숨을 걸고 뛰어든 ‘벤 리처즈’는 단숨에 전 세계 시청자들의 주목을 받게 된다. 하지만, 프로그램이 계속될수록 그 이면에 감춰진 진실을 알게 된 ‘벤 리처즈’. 보란듯이 판을 뒤집고, 자신만의 방식으로 게임을 이끌어가기 시작한다. 전 세계가 노리는 단 하나의 사냥감 목숨 걸린 서바이벌, 생존은 쇼가 된다!', '/static/img/movie/러닝맨.jpg', 133, '/static/img/movie/러닝맨.jpg' ),
--(4, '명량', 'ROARING CURRENTS', '김한민', '최민식, 류승룡, 조진웅', '대한민국', '2014-07-30', '1597년 임진왜란 6년, 오랜 전쟁으로 인해 혼란이 극에 달한 조선. 무서운 속도로 한양으로 북상하는 왜군에 의해 국가존망의 위기에 처하자 누명을 쓰고 파면 당했던 이순신 장군(최민식)이 삼도수군통제사로 재임명된다. 하지만 그에게 남은 건 전의를 상실한 병사와 두려움에 가득 찬 백성, 그리고 12척의 배 뿐. 마지막 희망이었던 거북선마저 불타고 잔혹한 성격과 뛰어난 지략을 지닌 용병 구루지마(류승룡)가 왜군 수장으로 나서자 조선은 더욱 술렁인다. 330척에 달하는 왜군의 배가 속속 집결하고 압도적인 수의 열세에 모두가 패배를 직감하는 순간, 이순신 장군은 단 12척의 배를 이끌고 명량 바다를 향해 나서는데…! 12척의 조선 vs 330척의 왜군 역사를 바꾼 위대한 전쟁이 시작된다!', '/static/img/movie/명량.jpg', 128, '/static/img/movie/명량.jpg' ),
--(5, '서울의 봄', '12.12: THE DAY', '김성수', '황정민, 정우성, 이성민', '대한민국', '2023-11-22', '1979년 12월 12일, 수도 서울 군사반란 발생 그날, 대한민국의 운명이 바뀌었다 대한민국을 뒤흔든 10월 26일 이후, 서울에 새로운 바람이 불어온 것도 잠시 12월 12일, 보안사령관 전두광이 반란을 일으키고 군 내 사조직을 총동원하여 최전선의 전방부대까지 서울로 불러들인다. 권력에 눈이 먼 전두광의 반란군과 이에 맞선 수도경비사령관 이태신을 비롯한 진압군 사이, 일촉즉발의 9시간이 흘러가는데… 목숨을 건 두 세력의 팽팽한 대립 오늘 밤, 대한민국 수도에서 가장 치열한 전쟁이 펼쳐진다!', '/static/img/movie/서울의봄.jpg', 169, '/static/img/movie/서울의봄세로.jpg' ),
--(6, '신과함께-죄와 벌', 'Along With the Gods: The Two Worlds', '김용화', '하정우, 차태현, 주지훈, 김향기', '대한민국', '2017-12-20', '저승 법에 의하면, 모든 인간은 사후 49일 동안 7번의 재판을 거쳐야만 한다. 살인, 나태, 거짓, 불의, 배신, 폭력, 천륜 7개의 지옥에서 7번의 재판을 무사히 통과한 망자만이 환생하여 새로운 삶을 시작할 수 있다. “김자홍 씨께선, 오늘 예정 대로 무사히 사망하셨습니다” 화재 사고 현장에서 여자아이를 구하고 죽음을 맞이한 소방관 자홍, 그의 앞에 저승차사 해원맥과 덕춘이 나타난다. 자신의 죽음이 아직 믿기지도 않는데 덕춘은 정의로운 망자이자 귀인이라며 그를 치켜세운다. 저승으로 가는 입구, 초군문에서 그를 기다리는 또 한 명의 차사 강림, 그는 차사들의 리더이자 앞으로 자홍이 겪어야 할 7개의 재판에서 변호를 맡아줄 변호사이기도 하다. 염라대왕에게 천년 동안 49명의 망자를 환생시키면 자신들 역시 인간으로 환생시켜 주겠다는 약속을 받은 삼차사들, 그들은 자신들이 변호하고 호위해야 하는 48번째 망자이자 19년 만에 나타난 의로운 귀인 자홍의 환생을 확신하지만, 각 지옥에서 자홍의 과거가 하나 둘씩 드러나면서 예상치 못한 고난과 맞닥뜨리는데… 누구나 가지만 아무도 본 적 없는 곳, 새로운 세계의 문이 열린다!', '/static/img/movie/신과함께.jpg', 139, '/static/img/movie/신과함께세로.jpg' ),
--(7, '아바타 : 불과 재', 'Avatar: Fire and Ash', '제임스 카메론', '샘 워싱턴, 조 샐다나', '미국', '2025-12-17', '판도라를 위협하는 재의 부족, 더 이상 인간만이 적이 아니다! 모두의 운명을 뒤흔들 거대한 전투가 시작된다! 인간들과의 전쟁으로 첫째 아들 ‘네테이얌’을 잃은 후, ‘제이크’와 ‘네이티리’는 깊은 슬픔에 빠진다. 상실에 빠진 이들 앞에 ''바랑''이 이끄는 재의 부족이 등장하면서, 판도라는 더욱 큰 위험에 빠지게 되고, ''설리'' 가족은 선택의 기로에 서게 되는데…', '/static/img/movie/아바타.jpg', 197, '/static/img/movie/아바타.jpg' );
--(8, '야당', 'YADANG: THE SNITCH', '황병국', '유해진, 강하늘, 박해준', '대한민국', '2025-04-16', '대한민국 마약 수사의 뒷거래 모든 것은 야당으로부터 시작된다! 누명을 쓰고 교도소에 수감된 이강수(강하늘)는 검사 구관희(유해진)로부터 감형을 조건으로 야당을 제안받는다. 강수는 관희의 야당이 돼 마약 수사를 뒤흔들기 시작하고, 출세에 대한 야심이 가득한 관희는 굵직한 실적을 올려 탄탄대로의 승진을 거듭한다. 한편, 마약수사대 형사 오상재(박해준)는 수사 과정에서 강수의 야당질로 번번이 허탕을 치고, 끈질긴 집념으로 강수와 관희의 관계를 파고든다. 마약판을 설계하는 브로커 강수, 더 높은 곳에 오르려는 관희, 마약 범죄 소탕에 모든 것을 건 상재. 세 사람은 각자 다른 이해관계로 얽히기 시작하는데…', '/static/img/movie/야당.jpg', 123, '/static/img/movie/야당세로.jpg' ),
--(9, '올빼미', 'The Night Owl', '안태진', '류준열, 유해진', '대한민국', '2022-11-23', '맹인이지만 뛰어난 침술 실력을 지닌 ‘경수’는 어의 ‘이형익’에게 그 재주를 인정받아 궁으로 들어간다. 그 무렵, 청에 인질로 끌려갔던 ‘소현세자’가 8년 만에 귀국하고, ‘인조’는 아들을 향한 반가움도 잠시 정체 모를 불안감에 휩싸인다. 그러던 어느 밤, 어둠 속에서는 희미하게 볼 수 있는 ‘경수’가 ‘소현세자’의 죽음을 목격하게 되고 진실을 알리려는 찰나 더 큰 비밀과 음모가 드러나며 목숨마저 위태로운 상황에 빠진다. 아들의 죽음 후 ‘인조’의 불안감은 광기로 변하여 폭주하기 시작하고 세자의 죽음을 목격한 ‘경수’로 인해 관련된 인물들의 민낯이 서서히 드러나게 되는데...', '/static/img/movie/올빼미.jpg', 118, '/static/img/movie/올빼미.jpg' ),
--(10, '윗집사람들', 'The People Upstairs', '하정우', '하정우, 공효진, 김동욱, 이하늬', '대한민국', '2025-12-03', '"세상의 부부들은 정말 밤마다 사랑을 나눌까? 너희도 솔직해지고 싶지 않아?" 불같던 결혼 생활은 사라지고 무미건조한 일상만 남은 정아(공효진)와 현수(김동욱). 요즘 두 사람을 가장 괴롭히는 건, 매일 밤 지나치게 활기찬 소리를 내는 윗집 부부 김 선생(하정우)과 수경(이하늬)이다. 정아는 이사 공사 소음을 참아준 윗집 부부를 위해 예의상 저녁 식사 자리를 마련하고 그날 저녁, 식탁에 마주 앉은 윗집 부부는 정아와 현수에게 전혀 예상하지 못한 제안을 하게 되는데…', '/static/img/movie/윗집사람들.jpg', 107, '/static/img/movie/윗집사람들.jpg' ),
--(11, '극장판 주술회전: 시부야사변 X 사멸회유', 'JUJUTSU KAISEN: Shibuya Incident', '고쇼조노 쇼타', '에노키 준야, 나카무라 유이치', '일본', '2025-12-03', '2018년 10월 31일 시부야 역 주변에 갑자기 ‘장막’이 내려지고, 다수의 일반인이 갇히게 된다. 그곳에 홀로 뛰어든 현대 최강의 주술사, 고죠 사토루. 그러나 그곳에는 고죠의 봉인을 꾀하는 주저사·주령들이 기다리고 있었다. 시부야에 집결하는 이타도리 유지를 비롯한 수많은 주술사들. 전례 없는 대규모 주술전 「시부야사변」이 시작된다-. 그리고 싸움은, 최악의 주술사 카모 노리토시가 꾸민 데스 게임 「사멸회유」로 이어진다. 「시부야사변」을 거쳐, 마굴로 변한 전국 10개의 결계(콜로니). 대혼란의 한가운데, 이타도리의 사형 집행인으로 특급 주술사 옷코츠 유타가 나타난다. 절망 속에서도 싸움을 계속하는 이타도리. 무정하게도 칼날을 겨누는 옷코츠. 가속해가는 저주의 혼돈. 같은 스승을 둔 이타도리와 옷코츠, 두 사람의 사투가 시작된다.', '/static/img/movie/주술회전.jpg', 87, '/static/img/movie/주술회전.jpg' ),
--(12, '주토피아 2', 'Zootopia 2', '바이론 하워드, 자레드 부시', '지니퍼 굿윈, 제이슨 베이트먼', '미국', '2025-11-26', '더 화려해진 세계, 더 넓어진 주토피아! 가~~장 사랑스러운 콤비 ''주디''와 ''닉''이 돌아온다! 미스터리한 뱀 ‘게리’가 나타난 순간, 주토피아가 다시 흔들리기 시작했다! 혼란에 빠진 도시를 구하기 위해 환상의 콤비 ‘주디’ & ‘닉’이 잠입 수사에 나서고 상상 그 이상의 진실과 위협을 마주하게 되는데...! 초특급 추적 어드벤처가 펼쳐진다!', '/static/img/movie/주토피아.jpg', 108, '/static/img/movie/주토피아.jpg' ),
--(13, '파묘', 'Exhuma', '장재현', '최민식, 김고은, 유해진, 이도현', '대한민국', '2024-02-22', '미국 LA, 거액의 의뢰를 받은 무당 ‘화림’(김고은)과 ‘봉길’(이도현)은 기이한 병이 대물림되는 집안의 장손을 만난다. 조상의 묫자리가 화근임을 알아챈 ‘화림’은 이장을 권하고, 돈 냄새를 맡은 최고의 풍수사 ‘상덕’(최민식)과 장의사 ‘영근’(유해진)이 합류한다. “전부 잘 알 거야… 묘 하나 잘못 건들면 어떻게 되는지” 절대 사람이 묻힐 수 없는 악지에 자리한 기이한 묘. ‘상덕’은 불길한 기운을 느끼고 제안을 거절하지만, ‘화림’의 설득으로 결국 파묘가 시작되고… 나와서는 안될 것이 나왔다.', '/static/img/movie/파묘.jpg', 134, '/static/img/movie/파묘.jpg' ),
--(14, '프레디의 피자가게 2', 'Five Nights at Freddy''s'' 2', '엠마 타미', '조쉬 허처슨, 엘리자베스 라일, 파이퍼 루비오', '미국', '2025-12-03', '다시 밤이 되었습니다 마스코트들은 이제 밖으로 나가주세요 소문과 괴담에 휘말려 폐업한 ‘프레디의 피자가게’ 본점이 수십년 만에 다시 열리고, 그곳에 오랫동안 잠들어 있던 신형 프레디와 친구들이 눈을 뜨게 된다. 안면 인식 시스템을 가진 한층 더 기괴하고 오싹해진 신형 애니메트로닉스들은 이제 피자가게 밖으로 나와 세상을 공포에 몰아넣기 시작하는데…', '/static/img/movie/피자가게2.jpg', 104, '/static/img/movie/피자가게2.jpg' ),
--(15, '한산', 'Hansan: Rising Dragon', '김한민', '박해일, 변요한, 안성기', '대한민국', '2022-07-27', '1592년 4월, 조선은 임진왜란 발발 후 단 15일 만에 왜군에 한양을 빼앗기며 절체절명의 위기에 놓인다. 조선을 단숨에 점령한 왜군은 명나라로 향하는 야망을 꿈꾸며 대규모 병역을 부산포로 집결시킨다. 한편, 이순신 장군은 연이은 전쟁의 패배와 선조마저 의주로 파천하며 수세에 몰린 상황에서도 조선을 구하기 위해 전술을 고민하며 출전을 준비한다. 하지만 앞선 전투에서 손상을 입은 거북선의 출정이 어려워지고, 거북선의 도면마저 왜군의 첩보에 의해 도난 당하게 되는데… 왜군은 연승에 힘입어 그 우세로 한산도 앞바다로 향하고, 이순신 장군은 조선의 운명을 가를 전투를 위해 필사의 전략을 준비한다. 1592년 여름, 음력 7월 8일 한산도 앞바다, 압도적인 승리가 필요한 조선의 운명을 건 지상 최고의 해전이 펼쳐진다.', '/static/img/movie/한산.jpg', 156, '/static/img/movie/한산세로.jpg' ),
--(16, '만약에 우리', 'Once We Were Us', '김도영', '구교환, 문가영', '대한민국', '2025-12-31', '"가장 초라했던 그때, 가장 눈부시던 우리" 고향 가는 고속버스에 올라탄 은호(구교환)와 휴학 후 어디론가 떠날 결심을 한 정원(문가영), 나란히 앉게 된 두 사람은 뜻밖의 인연을 맺는다. 서로의 꿈을 응원하며 의지하던 두 사람은 어느새 일상 깊숙이 스며들어 연인으로 발전한다. 웃고, 싸우고, 화해하며 세상을 다 가진 듯 뜨겁게 사랑하지만, 현실의 벽 앞에 두 사람은 결국 다른 길을 선택하게 된다. 그렇게 10년이 지난 후, 다시 마주한 순간 은호는 정원에게 오랫동안 묻어두었던 한마디를 꺼낸다. “만약에 우리...”', '/static/img/movie/만약에우리.jpg', 156, '/static/img/movie/만약에우리.jpg' );





SELECT * FROM movie_genre

--UPDATE movie
--SET detail_img_path = '/static/img/movie/인터스텔라세로.jpg'
--WHERE movie_id = 1;

